#+TITLE: Bash Mastery Documentation & Logs
#+AUTHOR: Angel Dhakal
#+DATE: 2025-12-07
#+DESCRIPTION: Documentation, Log, References, Resource for Bash Mastery
#+KEYWORDS: bash, mastery, documentation, technical-docs, linux, linux-docs, shell
#+OPTIONS: ^:{} num:nil toc:5 html-postamble:nil
#+HTML_HEAD: <meta name="pub_date" content="2025-12-07" />
#+HTML_HEAD: <meta name="updated_date" content="2025-12-07" />
#+EXPORT_FILE_NAME: /home/angel/xynapz/angeld.me/src/content/writings/linux/bash-mastery-documentation-and-logs.html

** Logging
While writing a shell script, in my opinion, it is very important to see real-time log of what commands are executing?, what procedure are being executed?, what issue has arrised? these details are very crucial for observing, analysing and debugging the script in case if the script fails or crashes. Using colorful text appropriately is a best practice that will make it easier to read info from a black screen.

To log data from a script to a standard output like a terminal screen, we can just do echo to print stuff on the screen.
#+begin_src bash
  echo "Message to log to the screen."
#+end_src

#+RESULTS:
: Message to log to the screen.

*** Global Variable
A global variable is a variable that is available in all the shells in a system. It is also called environment variables. They are named *ALL_CAPS* to denote they are global or environment variables. They can be set in shell configuration files which makes it available to all available shells. In a shell, we can view all global variables using *env* or *printenv* commands.

#+begin_src bash
  env
#+end_src

#+RESULTS:
| SHELL=/usr/bin/zsh                                                                                   |
| HYPRLAND_CMD=Hyprland                                                                                 |
| XDG_SESSION_PATH=/org/freedesktop/DisplayManager/Session1                                              |
| XDG_BACKEND=wayland                                                                                   |
| DESKTOP_SESSION=hyprland                                                                              |
| XDG_SEAT=seat0                                                                                        |
| PWD=/home/angel/dotfiles/scripts/setup                                                               |
| XDG_SESSION_DESKTOP=Hyprland                                                                           |
| LOGNAME=angel                                                                                        |
| XDG_SESSION_TYPE=wayland                                                                               |
| _=/usr/bin/env                                                                                       |
| MOTD_SHOWN=pam                                                                                        |
| HOME=/home/angel                                                                                     |
| LANG=en_US.UTF-8                                                                                      |
| _JAVA_AWT_WM_NONREPARENTING=1                                                                           |
| XDG_CURRENT_DESKTOP=Hyprland                                                                           |
| WAYLAND_DISPLAY=wayland-1                                                                             |
| XDG_SEAT_PATH=/org/freedesktop/DisplayManager/Seat0                                                    |
| XDG_SESSION_CLASS=user                                                                                 |
| TERM=dumb                                                                                            |
| USER=angel                                                                                           |
| HYPRLAND_INSTANCE_SIGNATURE=386376400119dd46a767c9f8c8791fd22c7b6e61_1765136001_108445813                |
| DISPLAY=:1                                                                                           |
| SHLVL=1                                                                                              |
| MOZ_ENABLE_WAYLAND=1                                                                                   |
| XDG_VTNR=1                                                                                            |
| XDG_SESSION_ID=2                                                                                       |
| XDG_RUNTIME_DIR=/run/user/1000                                                                         |
| DEBUGINFOD_URLS=https://debuginfod.archlinux.org                                                      |
| PATH=/usr/local/sbin:/usr/local/bin:/usr/bin:/usr/bin/site_perl:/usr/bin/vendor_perl:/usr/bin/core_perl |
| DBUS_SESSION_BUS_ADDRESS=unix:path=/run/user/1000/bus                                                   |
| MAIL=/var/spool/mail/angel                                                                           |
| OLDPWD=/home/angel                                                                                   |

*** Creating Variables
Variables in bash are case-sensitive, naming a variable is simple in bash, you can give any name, but giving a variable a name that starts with a digit is an error.

#+begin_src bash
  1name="Angel"
  echo "$1name"
#+end_src

#+RESULTS:
: name
: bash: line 1: 1name=Angel: command not found

**** Space around equals (=) sign
Giving a space around equal sign will result in an error. Examples

#+begin_src bash
  name = "Angel"
  echo "$name"
#+end_src

#+RESULTS:
: bash: line 1: name: command not found

#+begin_src bash
  name="Angel"
  echo "$name"
#+end_src

#+RESULTS:
: Angel

Above in the the first example, if you look closely, there is space around *=* while assigning *Angel* to name, this is not allowed while creating a variable in bash, the second code block which doesn't have any leading or trailing space around *=* sign, is valid syntax to create a variable in bash.

**** Escape Character
Escape character is used to remove the special meaning from a single character. To acheive this a non-quoted backslash, *\*, is used as the escape character in bash.

#+begin_src bash
  #without escape char
  name="Angel"
  echo "$name"

  #with escape char
  echo "\$name"
#+end_src

#+RESULTS:
| Angel |
| $name |

**** Single Quotes
Everything withing the single quotes is taken literally, this is also called strong quoting. Every special characters inside the single quote loses its meaning these include *$*, *\*, *\"* etc. A single quote character *'* also cannot be inside single quotes.

One example:
#+begin_src bash
  echo '$date'
#+end_src

#+RESULTS:
: $date

** Functions
In bash, functions exists, like other programming languages, they are used for reusing repetitive piece of logic multiple times without repeating too much. Function usually takes arguments executes some instructions or commands in bash and return back. The syntax for a function is simple, the name of the function followd by a pair of parenthesis, and the function's body enclosed inside a pair of curly braces.

#+begin_src bash
  log () {
      echo "Static Message"
  }

  log_file() {
      echo "$1"
  }

  log
  log_file "test.sh"
#+end_src

#+RESULTS:
| Static  | Message |
| test.sh |         |

